garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F15Q41.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLCIN1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLCIN1PPS" edc:nzwidth="8" edc:por="--010011" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x262">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN1PPS0" edc:mask="0x1" edc:name="CLCIN1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS1" edc:mask="0x1" edc:name="CLCIN1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS2" edc:mask="0x1" edc:name="CLCIN1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS3" edc:mask="0x1" edc:name="CLCIN1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS4" edc:mask="0x1" edc:name="CLCIN1PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS5" edc:mask="0x1" edc:name="CLCIN1PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLCIN1PPS" edc:mask="0x3f" edc:name="CLCIN1PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLCIN2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLCIN2PPS" edc:nzwidth="8" edc:por="--001100" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x263">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN2PPS0" edc:mask="0x1" edc:name="CLCIN2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS1" edc:mask="0x1" edc:name="CLCIN2PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS2" edc:mask="0x1" edc:name="CLCIN2PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS3" edc:mask="0x1" edc:name="CLCIN2PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS4" edc:mask="0x1" edc:name="CLCIN2PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS5" edc:mask="0x1" edc:name="CLCIN2PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLCIN2PPS" edc:mask="0x3f" edc:name="CLCIN2PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLCIN3PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLCIN3PPS" edc:nzwidth="8" edc:por="--001101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x264">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN3PPS0" edc:mask="0x1" edc:name="CLCIN3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS1" edc:mask="0x1" edc:name="CLCIN3PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS2" edc:mask="0x1" edc:name="CLCIN3PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS3" edc:mask="0x1" edc:name="CLCIN3PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS4" edc:mask="0x1" edc:name="CLCIN3PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS5" edc:mask="0x1" edc:name="CLCIN3PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLCIN3PPS" edc:mask="0x3f" edc:name="CLCIN3PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x4" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x265"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADACTPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="ADACTPPS" edc:nzwidth="8" edc:por="--010010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x269">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADACTPPS0" edc:mask="0x1" edc:name="ADACTPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS1" edc:mask="0x1" edc:name="ADACTPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS2" edc:mask="0x1" edc:name="ADACTPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS3" edc:mask="0x1" edc:name="ADACTPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS4" edc:mask="0x1" edc:name="ADACTPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADACTPPS5" edc:mask="0x1" edc:name="ADACTPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADACTPPS" edc:mask="0x3f" edc:name="ADACTPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="SPI1SCKPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="SPI1SCKPPS" edc:nzwidth="8" edc:por="--001110" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x26A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI1SCKPPS" edc:mask="0x3f" edc:name="SPI1SCKPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI1SCKPPS0" edc:mask="0x1" edc:name="SPI1SCKPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SCKPPS1" edc:mask="0x1" edc:name="SPI1SCKPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SCKPPS2" edc:mask="0x1" edc:name="SPI1SCKPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SCKPPS3" edc:mask="0x1" edc:name="SPI1SCKPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SCKPPS4" edc:mask="0x1" edc:name="SPI1SCKPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SCKPPS5" edc:mask="0x1" edc:name="SPI1SCKPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="SPI1SDIPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="SPI1SDIPPS" edc:nzwidth="8" edc:por="--001100" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x26B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI1SDIPPS" edc:mask="0x3f" edc:name="SPI1SDIPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI1SDIPPS0" edc:mask="0x1" edc:name="SPI1SDIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SDIPPS1" edc:mask="0x1" edc:name="SPI1SDIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SDIPPS2" edc:mask="0x1" edc:name="SPI1SDIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SDIPPS3" edc:mask="0x1" edc:name="SPI1SDIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SDIPPS4" edc:mask="0x1" edc:name="SPI1SDIPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SDIPPS5" edc:mask="0x1" edc:name="SPI1SDIPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="SPI1SSPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="SPI1SSPPS" edc:nzwidth="8" edc:por="--010110" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x26C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI1SSPPS" edc:mask="0x3f" edc:name="SPI1SSPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI1SSPPS0" edc:mask="0x1" edc:name="SPI1SSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS1" edc:mask="0x1" edc:name="SPI1SSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS2" edc:mask="0x1" edc:name="SPI1SSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS3" edc:mask="0x1" edc:name="SPI1SSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS4" edc:mask="0x1" edc:name="SPI1SSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSPPS5" edc:mask="0x1" edc:name="SPI1SSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="SPI2SCKPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="SPI2SCKPPS" edc:nzwidth="8" edc:por="--001111" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x26D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI2SCKPPS" edc:mask="0x3f" edc:name="SPI2SCKPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI2SCKPPS0" edc:mask="0x1" edc:name="SPI2SCKPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SCKPPS1" edc:mask="0x1" edc:name="SPI2SCKPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SCKPPS2" edc:mask="0x1" edc:name="SPI2SCKPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SCKPPS3" edc:mask="0x1" edc:name="SPI2SCKPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SCKPPS4" edc:mask="0x1" edc:name="SPI2SCKPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SCKPPS5" edc:mask="0x1" edc:name="SPI2SCKPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="SPI2SDIPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="SPI2SDIPPS" edc:nzwidth="8" edc:por="--001101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x26E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI2SDIPPS" edc:mask="0x3f" edc:name="SPI2SDIPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI2SDIPPS0" edc:mask="0x1" edc:name="SPI2SDIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SDIPPS1" edc:mask="0x1" edc:name="SPI2SDIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SDIPPS2" edc:mask="0x1" edc:name="SPI2SDIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SDIPPS3" edc:mask="0x1" edc:name="SPI2SDIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SDIPPS4" edc:mask="0x1" edc:name="SPI2SDIPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SDIPPS5" edc:mask="0x1" edc:name="SPI2SDIPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="SPI2SSPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="SPI2SSPPS" edc:nzwidth="8" edc:por="--000001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_20pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x26F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI2SSPPS" edc:mask="0x3f" edc:name="SPI2SSPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI2SSPPS0" edc:mask="0x1" edc:name="SPI2SSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SSPPS1" edc:mask="0x1" edc:name="SPI2SSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SSPPS2" edc:mask="0x1" edc:name="SPI2SSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SSPPS3" edc:mask="0x1" edc:name="SPI2SSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SSPPS4" edc:mask="0x1" edc:name="SPI2SSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SSPPS5" edc:mask="0x1" edc:name="SPI2SSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
