garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F15Q41.PIC
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="T0CON0" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="T0CON0" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-01631_tmr_mid0_v1_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x31A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OUTPS" edc:desc="" edc:mask="0xf" edc:name="OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="MD16" edc:desc="" edc:mask="0x1" edc:name="MD16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T0OUTPS" edc:mask="0xf" edc:name="T0OUTPS" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="T0MD16" edc:mask="0x1" edc:name="T0MD16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0OUT" edc:mask="0x1" edc:name="T0OUT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T0EN" edc:mask="0x1" edc:name="T0EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OUTPS0" edc:mask="0x1" edc:name="OUTPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OUTPS1" edc:mask="0x1" edc:name="OUTPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OUTPS2" edc:mask="0x1" edc:name="OUTPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OUTPS3" edc:mask="0x1" edc:name="OUTPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T016BIT" edc:mask="0x1" edc:name="T016BIT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T0OUTPS0" edc:mask="0x1" edc:name="T0OUTPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0OUTPS1" edc:mask="0x1" edc:name="T0OUTPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0OUTPS2" edc:mask="0x1" edc:name="T0OUTPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0OUTPS3" edc:mask="0x1" edc:name="T0OUTPS3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T0CON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T0CON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-01631_tmr_mid0_v1_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x31B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0xf" edc:name="CKPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="ASYNC" edc:desc="" edc:mask="0x1" edc:name="ASYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x7" edc:name="CS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CKPS0" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:mask="0x1" edc:name="CKPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS2" edc:mask="0x1" edc:name="CKPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS3" edc:mask="0x1" edc:name="CKPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0ASYNC" edc:mask="0x1" edc:name="T0ASYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T0CKPS" edc:mask="0xf" edc:name="T0CKPS" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS" edc:mask="0x7" edc:name="T0CS" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T0CKPS0" edc:mask="0x1" edc:name="T0CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKPS1" edc:mask="0x1" edc:name="T0CKPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKPS2" edc:mask="0x1" edc:name="T0CKPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKPS3" edc:mask="0x1" edc:name="T0CKPS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS0" edc:mask="0x1" edc:name="T0CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS1" edc:mask="0x1" edc:name="T0CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CS2" edc:mask="0x1" edc:name="T0CS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T2TMR" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T2TMR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x31C">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR2" edc:desc="" edc:mask="0xff" edc:name="TMR2" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T2PR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="T2PR" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x31D">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PR2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR2" edc:desc="" edc:mask="0xff" edc:name="PR2" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T2CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T2CON" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x31E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OUTPS" edc:desc="" edc:mask="0xf" edc:name="OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0x7" edc:name="CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2OUTPS" edc:desc="" edc:mask="0xf" edc:name="T2OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="T2CKPS" edc:desc="" edc:mask="0x7" edc:name="T2CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="T2ON" edc:desc="" edc:mask="0x1" edc:name="T2ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPS0" edc:desc="" edc:mask="0x1" edc:name="T2CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPS1" edc:desc="" edc:mask="0x1" edc:name="T2CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPS2" edc:desc="" edc:mask="0x1" edc:name="T2CKPS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OUTPS0" edc:desc="" edc:mask="0x1" edc:name="OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS1" edc:desc="" edc:mask="0x1" edc:name="OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS2" edc:desc="" edc:mask="0x1" edc:name="OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS3" edc:desc="" edc:mask="0x1" edc:name="OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS0" edc:desc="" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:desc="" edc:mask="0x1" edc:name="CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS2" edc:desc="" edc:mask="0x1" edc:name="CKPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR2ON" edc:desc="" edc:mask="0x1" edc:name="TMR2ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T2HLT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T2HLT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x31F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x1f" edc:name="MODE" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="CKSYNC" edc:desc="" edc:mask="0x1" edc:name="CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPOL" edc:desc="" edc:mask="0x1" edc:name="CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSYNC" edc:desc="" edc:mask="0x1" edc:name="PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE4" edc:mask="0x1" edc:name="MODE4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2MODE" edc:desc="" edc:mask="0x1f" edc:name="T2MODE" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="T2CKSYNC" edc:desc="" edc:mask="0x1" edc:name="T2CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPOL" edc:desc="" edc:mask="0x1" edc:name="T2CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2PSYNC" edc:desc="" edc:mask="0x1" edc:name="T2PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T2MODE0" edc:desc="" edc:mask="0x1" edc:name="T2MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2MODE1" edc:desc="" edc:mask="0x1" edc:name="T2MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2MODE2" edc:desc="" edc:mask="0x1" edc:name="T2MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2MODE3" edc:desc="" edc:mask="0x1" edc:name="T2MODE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2MODE4" edc:mask="0x1" edc:name="T2MODE4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="T2CLKCON" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="T2CLKCON" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x320">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="T2CLK"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:mask="0xf" edc:name="CS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:mask="0x1" edc:name="CS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2CS" edc:mask="0xf" edc:name="T2CS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T2CS0" edc:mask="0x1" edc:name="T2CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CS1" edc:mask="0x1" edc:name="T2CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CS2" edc:mask="0x1" edc:name="T2CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CS3" edc:mask="0x1" edc:name="T2CS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T2RST" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="T2RST" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x321">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSEL" edc:mask="0x1f" edc:name="RSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RSEL0" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL1" edc:mask="0x1" edc:name="RSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL2" edc:mask="0x1" edc:name="RSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL3" edc:mask="0x1" edc:name="RSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL4" edc:mask="0x1" edc:name="RSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2RSEL" edc:mask="0x1f" edc:name="T2RSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T2RSEL0" edc:mask="0x1" edc:name="T2RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL1" edc:mask="0x1" edc:name="T2RSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL2" edc:mask="0x1" edc:name="T2RSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL3" edc:mask="0x1" edc:name="T2RSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL4" edc:mask="0x1" edc:name="T2RSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x322"/>
        <edc:JoinedSFRDef edc:cname="TMR3" edc:desc="Joined 16-bit Timer" edc:name="TMR3" edc:nzwidth="0x10" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x323"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR3L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x323">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3L" edc:mask="0xff" edc:name="TMR3L" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR3L0" edc:mask="0x1" edc:name="TMR3L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L1" edc:mask="0x1" edc:name="TMR3L1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L2" edc:mask="0x1" edc:name="TMR3L2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L3" edc:mask="0x1" edc:name="TMR3L3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L4" edc:mask="0x1" edc:name="TMR3L4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L5" edc:mask="0x1" edc:name="TMR3L5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L6" edc:mask="0x1" edc:name="TMR3L6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3L7" edc:mask="0x1" edc:name="TMR3L7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR30" edc:mask="0x1" edc:name="TMR30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR31" edc:mask="0x1" edc:name="TMR31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR32" edc:mask="0x1" edc:name="TMR32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR33" edc:mask="0x1" edc:name="TMR33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR34" edc:mask="0x1" edc:name="TMR34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR35" edc:mask="0x1" edc:name="TMR35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR36" edc:mask="0x1" edc:name="TMR36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR37" edc:mask="0x1" edc:name="TMR37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR3H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x324">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3H" edc:mask="0xff" edc:name="TMR3H" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR3H0" edc:mask="0x1" edc:name="TMR3H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3H1" edc:mask="0x1" edc:name="TMR3H1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3H2" edc:mask="0x1" edc:name="TMR3H2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3H3" edc:mask="0x1" edc:name="TMR3H3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3H4" edc:mask="0x1" edc:name="TMR3H4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3H5" edc:mask="0x1" edc:name="TMR3H5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3H6" edc:mask="0x1" edc:name="TMR3H6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3H7" edc:mask="0x1" edc:name="TMR3H7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR38" edc:mask="0x1" edc:name="TMR38" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR39" edc:mask="0x1" edc:name="TMR39" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR310" edc:mask="0x1" edc:name="TMR310" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR311" edc:mask="0x1" edc:name="TMR311" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR312" edc:mask="0x1" edc:name="TMR312" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR313" edc:mask="0x1" edc:name="TMR313" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR314" edc:mask="0x1" edc:name="TMR314" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR315" edc:mask="0x1" edc:name="TMR315" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
